stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal.c
  return flag;
}

/**
  * @brief  Configure the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IO_VDD_CELL Compensation cell for the I/O supplied by vdd
  *            @arg SYSCFG_IO_VDDIO2_CELL Compensation cell for the I/O supplied by vddio2
  * @param  Code code selection to be applied for the I/O compensation cell
  *         This parameter can be one of the following values:
  *            @arg SYSCFG_IO_CELL_CODE  Code from the cell (available in the SYSCFG_CCVR)
  *            @arg SYSCFG_IO_REGISTER_CODE Code from the compensation cell code register (SYSCFG_CCCR)
  * @param  NmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Nmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @param  PmosValue In case SYSCFG_IO_REGISTER_CODE is selected, it  provides the Pmos value
  *                   to apply in range 0 to 15 else this parameter is not used
  * @retval None
  */
void HAL_SYSCFG_ConfigCompensationCell(uint32_t Selection, uint32_t Code, uint32_t NmosValue, uint32_t PmosValue)
{
  uint32_t offset;

  /* Check the parameters */
  assert_param(IS_SYSCFG_COMPENSATION_CELL(Selection));
  assert_param(IS_SYSCFG_IO_COMPENSATION_CODE(Code));

  if (Code == SYSCFG_IO_REGISTER_CODE)
  {
    /* Check the parameters */
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_NMOS_VALUE(NmosValue));
    assert_param(IS_SYSCFG_IO_COMPENSATION_CELL_PMOS_VALUE(PmosValue));

    offset = ((Selection == SYSCFG_IO_VDD_CELL) ? 0U : 8U);

    MODIFY_REG(SYSCFG->CCCR, (0xFFU << offset), ((NmosValue << offset) | (PmosValue << (offset + 4U))));
  }

  MODIFY_REG(SYSCFG->CCCSR, (Selection << 1U), (Code << (POSITION_VAL(Selection) + 1U)));
}

/**
  * @brief  Get the code selection for the compensation cell
  * @param  Selection specifies the concerned compensation cell
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IO_VDD_CELL Compensation cell for the I/O supplied by vdd
  *            @arg SYSCFG_IO_VDDIO2_CELL Compensation cell for the I/O supplied by vddio2
  * @param  pCode pointer code selection
  * @param  pNmosValue pointer to the Nmos value in range 0 to 15
  * @param  pPmosValue pointer to the Pmos value in range 0 to 15
  * @retval  HAL_OK (all values available) or HAL_ERROR (check parameters)
  */
HAL_StatusTypeDef HAL_SYSCFG_GetCompensationCell(uint32_t Selection, uint32_t *pCode, uint32_t *pNmosValue,
                                                 uint32_t *pPmosValue)
{
  uint32_t reg;
  uint32_t offset;
  HAL_StatusTypeDef status = HAL_ERROR;

  /* Check parameters */
  if ((pCode != NULL) && (pNmosValue != NULL) && (pPmosValue != NULL))
  {
    *pCode = ((SYSCFG->CCCSR & (Selection << 1U)) == 0U) ? SYSCFG_IO_CELL_CODE : SYSCFG_IO_REGISTER_CODE;

    reg = (*pCode == SYSCFG_IO_CELL_CODE) ? (SYSCFG->CCVR) : (SYSCFG->CCCR);
    offset = ((Selection == SYSCFG_IO_VDD_CELL) ? 0U : 8U);

    *pNmosValue = ((reg >> offset) & 0xFU);
    *pPmosValue = ((reg >> (offset + 4U)) & 0xFU);

    status = HAL_OK;
  }
  return status;
}

/**
  * @brief  Configure the infrared (IR) interface
  * @param  Modulation
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IR_MOD_TIM16
  *            @arg SYSCFG_IR_MOD_USART1
  *            @arg SYSCFG_IR_MOD_UART4
  * @param  OutputPol
  *         This parameter can one of the following values:
  *            @arg SYSCFG_IR_OUTPUTPOL_NONINVERTED
  *            @arg SYSCFG_IR_OUTPUTPOL_INVERTED
  * @retval  None
  */
void HAL_SYSCFG_ConfigIR(uint32_t Modulation, uint32_t OutputPol)
{
  assert_param(IS_SYSCFG_IR_MODULATION(Modulation));
  assert_param(IS_SYSCFG_IR_OUTPUTPOL(OutputPol));

  MODIFY_REG(SYSCFG->CFGR1, SYSCFG_CFGR1_IR_MOD | SYSCFG_CFGR1_IR_POL, Modulation | OutputPol);
}

/**
  * @brief  Get the infrared (IR) interface configuration
  * @param  pModulation pointer to Modulation
  * @param  pOutputPol  pointer to Output Polarity
  * @retval  HAL_OK (all values available) or HAL_ERROR (check parameters)
  */
HAL_StatusTypeDef HAL_SYSCFG_GetConfigIR(uint32_t *pModulation, uint32_t *pOutputPol)
{
  uint32_t reg;
  HAL_StatusTypeDef status = HAL_ERROR;

  /* Check parameters */
  if ((pModulation != NULL) && (pOutputPol != NULL))
  {
    reg = SYSCFG->CFGR1;

    *pModulation = (uint32_t)(READ_BIT(reg, SYSCFG_CFGR1_IR_MOD));
    *pOutputPol  = (uint32_t)(READ_BIT(reg, SYSCFG_CFGR1_IR_POL));

    status = HAL_OK;
  }
  return status;
}

/**
  * @}
  */

/** @defgroup HAL_Exported_Functions_Group5 HAL SYSCFG lock management functions
  *  @brief SYSCFG lock management functions.
  *
@verbatim
 ===============================================================================
                       ##### SYSCFG lock functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Lock the SYSCFG item(s).
  * @note   Setting lock(s) depends on privilege mode in secure/non-secure code
  *         Lock(s) cleared only at system reset
  * @param  Item Item(s) to set lock on.
  *         This parameter can be a combination of @ref SYSCFG_Lock_items
  * @retval None
  */
void HAL_SYSCFG_Lock(uint32_t Item)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_LOCK_ITEMS(Item));

  /* Privilege secure/non-secure locks */
  SYSCFG->CNSLCKR = (0xFFFFU & Item);  /* non-secure lock item in 16 lowest bits */

#if defined (CPU_IN_SECURE_STATE)
  /* Privilege secure only locks */
  SYSCFG->CSLCKR = ((0xFFFF0000U & Item) >> 16U);  /* Secure-only lock item in 16 highest bits */
#endif /* CPU_IN_SECURE_STATE */
}

/**
  * @brief  Get the lock state of SYSCFG item.
  * @note   Getting lock(s) depends on privilege mode in secure/non-secure code
  * @param  pItem pointer to return locked items
  *         the return value can be a combination of @ref SYSCFG_Lock_items
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SYSCFG_GetLock(uint32_t *pItem)
{
  uint32_t tmp_lock;

  /* Check null pointer */
  if (pItem == NULL)
  {
    return HAL_ERROR;
  }

  /* Get the non-secure lock state */
  tmp_lock = SYSCFG->CNSLCKR;

  /* Get the secure lock state in secure code */
#if defined (CPU_IN_SECURE_STATE)
  tmp_lock |= (SYSCFG->CSLCKR << 16U);
#endif /* CPU_IN_SECURE_STATE */

  /* Return overall lock status */
  *pItem = tmp_lock;

  return HAL_OK;
}

/**
  * @}
  */


